rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
    localAddr.sin_family      = AF_INET;
    localAddr.sin_addr.s_addr = htonl(INADDR_ANY);
    localAddr.sin_port        = htons(arg0);

    status = bind(server, (struct sockaddr *)&localAddr, sizeof(localAddr));

    if (status == -1) {
        System_printf("Error: bind failed.\n");
            goto shutdown;
    }

    status = listen(server, NUMTCPWORKERS);

    if (status == -1) {
        System_printf("Error: listen failed.\n");
            goto shutdown;
    }

    optval = 100;

    if (setsockopt(server, SOL_SOCKET, SO_KEEPALIVE, &optval, optlen) < 0) {
        System_printf("Error: setsockopt failed\n");
        goto shutdown;
    }

    while ((clientfd = accept(server, (struct sockaddr *)&clientAddr, &addrlen)) != -1)
    {
        //System_printf("tcpStateHandler: Creating thread clientfd = %d\n", clientfd);
        //System_flush();

        /* Init the Error_Block */
        Error_init(&eb);

        /* Initialize the defaults and set the parameters. */
        Task_Params_init(&taskParams);
        taskParams.arg0      = (UArg)clientfd;
        taskParams.stackSize = 1280;

        taskHandle = Task_create((Task_FuncPtr)tcpCommandWorker, &taskParams, &eb);

        if (taskHandle == NULL) {
            //System_printf("Error: Failed to create new Task\n");
            //System_flush();
            close(clientfd);
        }

        /* addrlen is a value-result param, must reset for next accept call */
        addrlen = sizeof(clientAddr);
    }

    System_printf("Error: accept failed.\n");
    System_flush();

shutdown:

    System_flush();

    if (server > 0) {
        close(server);
    }
}

//*****************************************************************************
// HANDLES COMMAND/RESPONSE REQUESTS FROM CLIENT. THERE CAN BE MULTIPLE
// COMMAND HANDLER WORKER THREADS RUNNING.
//*****************************************************************************

Void tcpCommandWorker(UArg arg0, UArg arg1)
{
    bool        connected = true;
    bool        notify;
    int         clientfd = (int)arg0;
    int         bytesSent;
    int         bytesToSend;
    int         bytesRcvd;
    int         bytesToRecv;
    int         ipos;
    size_t      index;
    uint16_t    status;
    uint8_t*    buf;
    uint32_t    mask;
    uint32_t    flags;

    STC_COMMAND_HDR msg;

    static const uint32_t smask[10] = {
        SW_LOC0, SW_LOC1, SW_LOC2, SW_LOC3, SW_LOC4,
        SW_LOC5, SW_LOC6, SW_LOC7, SW_LOC8, SW_LOC9
    };

    System_printf("tcpCommandWorker: CONNECT clientfd = 0x%x\n", clientfd);
    System_flush();

    while (connected)
    {
        bytesToRecv = sizeof(STC_COMMAND_HDR);

        buf = (uint8_t*)&msg;

        do {

            if ((bytesRcvd = recv(clientfd, buf, bytesToRecv, 0)) <= 0)
            {
                System_printf("Error: tpc recv failed %d.\n", bytesRcvd);
                break;
            }

            bytesToRecv -= bytesRcvd;

            buf += bytesRcvd;

        } while(bytesToRecv > 0);

        msg.status = status = 0;

        index = (size_t)msg.index;

        /*
         * Determine which command to process from the client
         */

        notify = false;

        switch(msg.command)
        {
        case STC_CMD_STOP:
            /* param1: not used, zero
             * param2: not used, zero
             */
            if (IsLocating())
                LocateCancel();
            Transport_PostButtonPress(S_STOP);
            break;

        case STC_CMD_REW:
            /* param1: flags STC_M_LIBWIND
             * param2: not used, zero
             */
            if (IsLocating())
                LocateCancel();
            mask = S_REW;
            /* simulate REC+FWD for lib wind mode */
            if (msg.param1.U & STC_M_LIBWIND)
                mask |= S_REC;
            Transport_PostButtonPress(mask);
            //Transport_Rew(0, msg.param1);
            break;

        case STC_CMD_FWD:
            /* param1: flags STC_M_LIBWIND
             * param2: not used, zero
             */
            if (IsLocating())
                LocateCancel();
            mask = S_FWD;
            /* simulate REC+FWD for lib wind mode */
            if (msg.param1.U & STC_M_LIBWIND)
                mask |= S_REC;
            Transport_PostButtonPress(mask);
            //Transport_Fwd(0, msg.param1);
            break;

        case STC_CMD_PLAY:
            /* param1: 1=play+record, 0=play mode
             * param2: not used, zero
             */
            if (IsLocating())
                LocateCancel();
            if (msg.param1.U == 1)
                Transport_PostButtonPress(S_PLAY|S_REC);
            else
                Transport_PostButtonPress(S_PLAY);
            break;

        case STC_CMD_LIFTER:
            /* param1: not used, zero
             * param2: not used, zero
             */
            Transport_PostButtonPress(S_LDEF);
            break;

        case STC_CMD_LOCATE_MODE_SET:
            /* param1: 1=store-mode, 0=cue-mode
             * param2: not used, zero
             */
            Remote_PostSwitchPress((msg.param1.U == 1) ? SW_STORE : SW_CUE, 0);
            break;

        case STC_CMD_LOCATE:
            // Start the auto-locator for the cue point index given
            /* param1: cue point index (0-9)
             * param2: cue flags, STC_CF_AUTO_PLAY or STC_CF_AUTO_REC
             */

            if (IsLocating())
                LocateCancel();

            if (msg.param1.U <= 9)
            {
                Remote_PostSwitchPress(smask[msg.param1.U], msg.param2.U);
            }
            else if (msg.param1.U == STC_CUE_POINT_HOME)
            {
                LocateSearch(CUE_POINT_HOME,  msg.param2.U);
            }
            else if (msg.param1.U == STC_CUE_POINT_MARK_IN)
            {
                LocateSearch(CUE_POINT_MARK_IN,  msg.param2.U);
            }
            else if (msg.param1.U == STC_CUE_POINT_MARK_OUT)
            {
                LocateSearch(CUE_POINT_MARK_OUT,  msg.param2.U);
            }
            else if (msg.param1.U == STC_CUE_POINT_PUNCH_IN)
            {
                LocateSearch(CUE_POINT_PUNCH_IN,  msg.param2.U);
            }
            else if (msg.param1.U == STC_CUE_POINT_PUNCH_OUT)
            {
                LocateSearch(CUE_POINT_PUNCH_OUT,  msg.param2.U);
            }
            break;

