rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
        case STC_CMD_LOCATE_AUTO_LOOP:
            /* param1: cue flags, CF_AUTO_PLAY, etc
             * param2: not used, zero
             */
            if (IsLocating())
                LocateCancel();

            status = LocateLoop((uint32_t)msg.param1.U);
            break;

        case STC_CMD_AUTO_PUNCH_SET:
            if (msg.param1.U)
            {
                SetButtonLedMask(STC_L_AUTO_PUNCH, 0);
                g_sysData.autoPunch = TRUE;
            }
            else
            {
                SetButtonLedMask(0, STC_L_AUTO_PUNCH);
                g_sysData.autoPunch = FALSE;
            }
            notify = TRUE;
            break;

        case STC_CMD_CUEPOINT_SET:
            /* param1: tape position
             * param2: cue flags (CF_ACTIVE, etc)
             */
            if (msg.param1.I == -1)
                ipos = g_sysData.tapePosition;
            else
                ipos = msg.param1.I;

            if (index == STC_CUE_POINT_MARK_IN)
            {
                SetButtonLedMask(STC_L_MARK_IN, 0);
                CuePointSet(index, ipos, flags);
            }
            else if (index == STC_CUE_POINT_MARK_OUT)
            {
                SetButtonLedMask(STC_L_MARK_OUT, 0);
                CuePointSet(index, ipos, flags);
            }
            else if (index == STC_CUE_POINT_PUNCH_IN)
            {
                SetButtonLedMask(STC_L_PUNCH_IN, 0);
                CuePointSet(index, ipos, flags);
            }
            else if (index == STC_CUE_POINT_PUNCH_OUT)
            {
                SetButtonLedMask(STC_L_PUNCH_OUT, 0);
                CuePointSet(index, ipos, flags);
            }
            else
            {
                CuePointSet(index, ipos, flags);
            }
            notify = true;
            break;

        case STC_CMD_CUEPOINT_GET:
            /* param1: cue point index
             * param2: not used, zero
             */
            mask = CuePointGet((size_t)msg.param1.U, &ipos);
            /* return position in param1, flags in param2 */
            msg.param1.I = ipos;
            msg.param2.U = mask;
            break;

        case STC_CMD_CUEPOINT_CLEAR:
            /* param1: cue point index, or -1 for all cue points
             * param2: not used, zero
             */
            if (msg.param1.U == STC_ALL_CUEPOINTS)
            {
                /* Clear all points 0-9 */
                CuePointClearAll();

                /* Clear loop mark in/out points */
                CuePointClear(CUE_POINT_MARK_IN);
                CuePointClear(CUE_POINT_MARK_OUT);

                /* Clear punch in/out points */
                CuePointClear(CUE_POINT_PUNCH_IN);
                CuePointClear(CUE_POINT_PUNCH_OUT);

                SetButtonLedMask(0, STC_L_LOC_MASK |
                                    STC_L_MARK_IN  | STC_L_MARK_OUT |
                                    STC_L_PUNCH_IN | STC_L_PUNCH_OUT);
            }
            else
            {
                CuePointClear((size_t)msg.param1.U);
            }
            notify = true;
            break;

        case STC_CMD_TRACK_SET_STATE:
            /* param1: index or -1 for all tracks
             * param2: track state bits
             */
            if (msg.param1.U == STC_ALL_TRACKS)
                Track_SetAll((uint8_t)msg.param2.U, 0);
            else
                Track_SetState((size_t)msg.param1.U, (uint8_t)msg.param2.U, 0);
            notify = true;
            break;

        case STC_CMD_TRACK_MASK_ALL:
            /* param1 = set mask,
             * param2 = clear mask
             */
            Track_MaskAll((uint8_t)msg.param1.U, (uint8_t)msg.param2.U);
            notify = true;
            break;

        case STC_CMD_TRACK_MODE_ALL:
            /* param1 = new transport mode
             * param2 = 0
             */
            Track_ModeAll((uint8_t)msg.param1.U);
            notify = true;
            break;

        case STC_CMD_ZERO_RESET:
            /* param1 = 0
             * param2 = 0
             */
            PositionZeroReset();
            notify = true;
            break;

        case STC_CMD_CANCEL:
            /* param1 = 0
             * param2 = 0
             */
            LocateCancel();
            break;
        }

        // Now send the response packet

        bytesToSend = sizeof(STC_COMMAND_HDR);

        buf = (uint8_t*)&msg;

        msg.status  = status;
        msg.datalen = 0;

        do {

            if ((bytesSent = send(clientfd, buf, bytesToSend, 0)) <= 0)
            {
                System_printf("Error: tpc send failed %d.\n", bytesSent);
                connected = false;
                break;
            }

            bytesToSend -= bytesSent;

            buf += bytesSent;

        } while (bytesToSend > 0);

        /* Notify refresh of current transport state change */

        if (notify)
            Event_post(g_eventTransport, Event_Id_03);
    }

    System_printf("tcpCommandWorker DISCONNECT clientfd = 0x%x\n", clientfd);
    System_flush();

    close(clientfd);
}

// End-Of-File
